{
  "topicId": "movement",
  "title": "Pieces & Movement",
  "content": "Each piece has its own “cost” and rules for how it can move\nNo piece can jump over other pieces except if explicitly stated.\nSee the list of available pieces below!\n\nKing (0 points): The king itself does not cost anything as one must be always included in your deck. The king can move in a one square vertically, horizontally or diagonally each turn.\nPawn (1 point): The pawn moves one square forward every turn. It cannot move backwards. To capture another piece, the pawn must do so one square diagonally – it cannot capture a piece directly in front of it.\nBishop (3 points): The bishop moves as far as it wants diagonally. Therefore, a bishop always stays on the same colour as it starts on.\nKnight (3 points): Moves in an “L” shape. Because of the tricky movement the knight can jump over other pieces.\nRook (5 points): Moves as far as it wants horizontally or vertically.\nWizard (5 points): Moves like the king – one square in any direction. (Can cast a fireball instead of attacking which has a range of 2 squares. This action replaces movement)\nArcher (5 points): The archer moves like a bishop, but can also attack like a knight. The attack replaces its movement. The archer will therefore always also be on the same colour it starts on.\nTurret (7 points): Moves like a rook, but can also move one square diagonally. Can capture other pieces from range.\nQueen (9 points): Moves like a rook and bishop combined. Can move as far as it wants horizontally, vertically or diagonally.\nDragon (12 points): The dragon is (currently) the most powerful piece in the game. It moves like a queen and knight combined! It can therefore move as far as it wants horizontally, vertically or diagonally, but also in an “L” shape if it wants!\n\nSpecial Rules\nSome pieces have special rules that apply to their movement or other things.\nPawn’s first move: Pawns may move two squares on their first move.\nPromotion: Pawns may promote to any piece it wants (except a king) when it reaches the opponents final rank (either 1 or 8 depending on if you are playing white or black).\nCastle: Rooks have a special interaction with the king called “Castling”. On a player's turn they may move their king two squares over to one side and then move the rook from that side right next to the king on the opposite side. To be able to castle it must be both the rook’s and king’s first move.\nKings: Two king may never move so they set each other in “check”. (See “Check” to learn more about this rule.)\n",
  "imagePath": null
}